ДипломПобожаяВК/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот_план</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот_план</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДипломПобожаяВК/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДипломПобожаяВК/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДипломПобожаяВК/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДипломПобожаяВК/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

ДипломПобожаяВК/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если Не ДоговорДействителен() Тогда
		ОбщегоНазначения.СообщитьПользователю("Проверьте атуальность или тип договора");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтоимостьЧасаРаботы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы"); 
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;	
	ЧасыКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	Движение.КоличествоЧасов = ЧасыКОплатеКлиенту;
	Движение.СуммаКОплате = ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПроцентОтРабот = Выборка.ПроцентОтРабот;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	// регистр ВКМ_ВыполненныеСотрудникомРаботы 
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ЧасыКОплатеКлиенту;
	Движение.СуммаКОплате = ЧасыКОплатеКлиенту * СтоимостьЧасаРаботы * ПроцентОтРабот / 100;
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоговорДействителен()
	
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВКМ_ДействуетС, ВКМ_ДействуетПо, ВидДоговора");
	
	ДействуетС = ДанныеДоговора.ВКМ_ДействуетС;
	ДействуетПо = ДанныеДоговора.ВКМ_ДействуетПо;
	ВидДоговора = ДанныеДоговора.ВидДоговора;
	
	Если Не ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание ИЛИ НЕ (Дата >= ДействуетС И Дата <= ДействуетПо) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДокументИзменен = Ложь;
	ТекстСообщения = "";
	
	Если Не ЭтотОбъект.Проведен Тогда   
		ДокументИзменен = Истина;
		ТекстСообщения =  СтрШаблон("Создан новый документ: %1", ЭтотОбъект);
	Иначе
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект, "ДатаПроведенияРабот, ВремяНачалаРабот_план, ВремяОкончанияРабот_план, Специалист");
		Если ДанныеДокумента.ДатаПроведенияРабот <> ЭтотОбъект.ДатаПроведенияРабот Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменилась дата проведения работ с %2 на %3", ЭтотОбъект.Ссылка, Формат(ДанныеДокумента.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(ЭтотОбъект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"));
		КонецЕсли;
		Если ДанныеДокумента.ВремяНачалаРабот_план <> ЭтотОбъект.ВремяНачалаРабот_план Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменилось время начала работ (план) с %2 на %3", ЭтотОбъект.Ссылка, Формат(ДанныеДокумента.ВремяНачалаРабот_план, "ДЛФ=T;"), Формат(ЭтотОбъект.ВремяНачалаРабот_план, "ДЛФ=T;"));
		КонецЕсли;
		Если ДанныеДокумента.ВремяОкончанияРабот_план <> ЭтотОбъект.ВремяОкончанияРабот_план Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменилось время окончания работ (план) с %2 на %3", ЭтотОбъект.Ссылка, Формат(ДанныеДокумента.ВремяОкончанияРабот_план, "ДЛФ=T;"), Формат(ЭтотОбъект.ВремяОкончанияРабот_план, "ДЛФ=T;"));
		КонецЕсли;
		Если ДанныеДокумента.Специалист <> ЭтотОбъект.Специалист Тогда
			ДокументИзменен = Истина;
			ТекстСообщения = ТекстСообщения + ?(ТекстСообщения <> "", Символы.ПС, "") + СтрШаблон("В документе: %1 изменился специалист с %2 на %3", ЭтотОбъект.Ссылка, ДанныеДокумента.Специалист, ЭтотОбъект.Специалист);
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументИзменен Тогда 
		
		НовыйСпр = Справочники.ВКМ_УведомленияТелеграм_БотуДляОтправки.СоздатьЭлемент();
		НовыйСпр.ТекстСообщения = ТекстСообщения; 
		НовыйСпр.Записать();
		
	КонецЕсли;
	//а = ЭтотОбъект;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
